src/InformationRegisters/MetaUUID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>MetaUUID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Configuration</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ref</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Catalogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/MetaUUID/Ext/ManagerModule.bsl
Function RefByUUID(Configuration, UUID) Export
	
	Query = New Query;
	Query.SetParameter("Configuration", Configuration);
	Query.SetParameter("UUID", UUID);
	Query.Text =
	"SELECT
	|	MetaUUID.Ref AS Ref,
	|	MetaUUID.Configuration AS Configuration
	|FROM
	|	InformationRegister.MetaUUID AS MetaUUID
	|WHERE
	|	MetaUUID.Configuration = &Configuration
	|	AND MetaUUID.UUID = &UUID";
	
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		Return Undefined;
	EndIf; 
	
	Return QueryResult.Unload()[0].Ref;
	
EndFunction // RefByUUID()
